000100 IDENTIFICATION                   DIVISION.
000200 PROGRAM-ID.                      ANMIKA.
000300 DATA                             DIVISION.
000400 WORKING-STORAGE                  SECTION.
000500 01 RDM_BASE    PIC 9V9(3).
000600 01 RDM         PIC 9(3).
000700 01 ANMIKA      PIC 9(10).
000800 PROCEDURE                        DIVISION.
000900 MAIN.
001000     PERFORM UNTIL ANMIKA EQUAL TO 9999999999
001100         MOVE FUNCTION RANDOM TO RDM_BASE
001200         MULTIPLY RDM_BASE BY 1000 GIVING RDM
001300         DISPLAY '白って' RDM '色あんねん'
001400         ADD 1 TO ANMIKA GIVING ANMIKA         
001500     END-PERFORM
001600     DISPLAY ANMIKA '人のアンミカ'
001700     STOP RUN.  